docs: lots of changes - part renames, some new parts, minor edits
